doom/config.org
#+TITLE: Santhosh's Doom Emacs Config
#+AUTHOR: Santhosh Krishnamoorthy
#+DESCRIPTION: Santhosh's personal Doom Emacs config.
#+STARTUP: showeverything

* TABLE OF CONTENTS :toc:
- [[#about-this-config-file][ABOUT THIS CONFIG FILE]]
- [[#platform][PLATFORM]]
- [[#doom-theme][DOOM Theme]]
- [[#doom-dashboard][DOOM DASHBOARD]]
- [[#evil][EVIL]]
- [[#ivy][IVY]]
  - [[#ivy-posframe][IVY-POSFRAME]]
  - [[#ivy-keybindings][IVY KEYBINDINGS]]
- [[#line-settings][LINE SETTINGS]]
- [[#evaluate-elisp-expressions][EVALUATE ELISP EXPRESSIONS]]
- [[#registers][REGISTERS]]
- [[#lsp][LSP]]
- [[#dap][DAP]]
  - [[#php][PHP]]
- [[#org-mode][ORG MODE]]
- [[#org-roam--deft][ORG ROAM & DEFT]]
- [[#ledger][LEDGER]]
- [[#elfeed][ELFEED]]
  - [[#elfeed-goodies][ELFEED GOODIES]]
  - [[#keybindings][KEYBINDINGS]]
  - [[#usability-enhancements][USABILITY ENHANCEMENTS]]
  - [[#visual-enhancements][VISUAL ENHANCEMENTS]]
- [[#spotify][SPOTIFY]]
- [[#blogging][BLOGGING]]
- [[#calendar][CALENDAR]]
- [[#eaf][EAF]]
- [[#emojis][EMOJIS]]
- [[#miscellaneous-settings][MISCELLANEOUS SETTINGS]]

* ABOUT THIS CONFIG FILE
My personal Doom Emacs config. Doom Emacs is a distribution of Emacs that uses the "evil" keybindings (Vim keybindings) and includes a number of nice extensions and a bit of configuration out of the box.
* PLATFORM
#+begin_src emacs-lisp

(setq platform "MAC")
;; Minimize garbage collection during startup
(setq gc-cons-threshold most-positive-fixnum)

;; Lower threshold back to 8 MiB (default is 800kB)
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (expt 2 23))))

(setq read-process-output-max (* 1024 1024))

;; Don't die when handling large, minified files
(global-so-long-mode 1)

#+end_src
* DOOM Theme
Setup a nice theme for DOOM

#+begin_src emacs-lisp
;;(setq doom-theme 'doom-gruvbox)
(setq doom-theme 'doom-dracula)
(when (not (string= platform "TERMUX"))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(default ((t (:family "JetBrainsMono Nerd Font" :foundry "nil" :slant normal :weight normal :height 161 :width normal)))))
)
(map! :leader
      :desc "Load new theme" "h t" #'load-theme)
#+end_src

